package com.mnfarzaneh.solalrchef.data

import com.mnfarzaneh.solalrchef.R
import com.mnfarzaneh.solalrchef.model.CookingStep
import com.mnfarzaneh.solalrchef.model.Ingredient
import com.mnfarzaneh.solalrchef.model.Recipe

object RecipeRepository {

    val recipes = listOf(

        Recipe(
            id = "bread",
            title = "نان خانگی",
            description =
                "📸 آموزش کامل این دستور در اینستاگرام:\n" +
                        "@DIY.BY.FARZANEH\n",
            image = R.drawable.breadmain,           // ← آیکون روی سولاردام
            detailImage = R.drawable.prebread,  // ← عکس صفحه جزئیات
            totalTime = "2 ساعت",
            cookTime = "15 دقیقه",
            yield = "2",
            calories = 910,
            ingredients = listOf(
                Ingredient("400", "گرم", "آرد نول"),
                Ingredient("100", "گرم", "آرد کامل"),
                Ingredient("10", "گرم", "نمک"),
                Ingredient("8", "گرم", "مخمر"),
                Ingredient("370", "گرم", "آب"),

                ),
            equipment = listOf(
                "ورزق نسوز آلمانی", "پارو", "فویل آلومینیومی"

            ),
            steps = listOf(

                CookingStep("🥣 آرد نول، آرد کامل، نمک، مخمر و آب را با هم مخلوط کن تا خمیر یکدستی به دست بیاید."),

                CookingStep("⚙️ خمیر را با سری هوک و سرعت ۱ حدود ۵ دقیقه ورز بده."),

                CookingStep("⚙️ سپس ۱۰ دقیقه با سری پدل و سرعت ۱ ورز بده تا زمانی که خمیر دور پدل جمع شود و از دیواره‌های کاسه جدا شود."),

                CookingStep("💪 خمیر را روی سطح کار منتقل کن و چند دقیقه با روش اسلپ اند فولد (Slap & Fold) کار کن تا بافت آن کشسان و یکدست شود."),

                CookingStep("🫒 یک ظرف را کمی روغن‌مالی کن و خمیر را داخل آن قرار بده."),

                CookingStep("⏰ اجازه بده خمیر ۲۰ دقیقه استراحت کند."),

                CookingStep("🔄 یک مرحله کویل فولد (Coil Fold) انجام بده و دوباره ۲۰ دقیقه استراحت بده."),

                CookingStep("🔄 مجدداً یک کویل فولد دیگر انجام بده و ۲۰ دقیقه دیگر استراحت بده."),

                CookingStep("🥄 در زمان استراحت خمیر، رومال را آماده کن."),

                CookingStep("🥣 ۱۰۰ گرم آب را با ۱۰ تا ۱۲ گرم آرد مخلوط کن و روی شعله ملایم هم بزن تا به غلظتی شبیه فرنی برسد."),

                CookingStep("✨ پس از برداشتن از روی حرارت، ۱ تا ۲ گرم جوش شیرین به آن اضافه کن و کنار بگذار تا خنک شود."),

                CookingStep("🌾 روی سطح کار کمی آرد بپاش و خمیر را به‌آرامی چونه کن."),

                CookingStep("📄 روی ورق نسوز مقداری سبوس گندم بپاش و خمیر را روی آن قرار بده."),

                CookingStep("⏰ اجازه بده خمیر ۲۰ دقیقه استراحت نهایی داشته باشد."),

                CookingStep("🖌️ رومال را روی سطح خمیر بمال."),

                CookingStep("👆 با نوک انگشت شیارهای مخصوص نان بربری را ایجاد کن و به خمیر فرم نهایی بده."),

                CookingStep(" ☀️ بخش سولاردام ☀️ "),

                CookingStep("🔥 سولاردام را روی حالت کانوکشن (Convection) قرار بده و با دمای ۲۲۰ درجه سانتی‌گراد پیش‌گرمایش کن."),

                CookingStep("🔔 پس از اتمام پیش‌گرمایش و شنیدن بوق دستگاه، با استفاده از پاروی نان، خمیر را به‌آرامی از روی ورق نسوز بلند کن و روی سینی فلزی سولاردام قرار بده."),

                CookingStep("⏱️ نان را حدود ۱۴ دقیقه بپز."),

                CookingStep("👀 پس از حدود ۸ دقیقه نان را بررسی کن. اگر قسمت‌هایی از روی نان طلایی شده اما بخش‌های دیگر هنوز رنگ نگرفته‌اند، یک تکه فویل آلومینیومی روی قسمت‌های طلایی قرار بده تا نسوزند."),

                CookingStep("✨ اجازه بده پخت ادامه پیدا کند تا تمام سطح نان به رنگ طلایی زیبا برسد."),

                CookingStep("🥖 پس از حدود ۱۴ دقیقه و رسیدن به رنگ دلخواه، با استفاده از پاروی نان، بربری را از سولاردام خارج کن."),

                CookingStep("😋 چند دقیقه اجازه بده نان خنک شود و سپس سرو کن. نوش جان!")


            )

        ),

        Recipe(
            id = "cake",
            title = "کیک اسفنجی",
            image = R.drawable.cakemain,           // ← آیکون روی سولاردام
            detailImage = R.drawable.precake,  // ← عکس صفحه جزئیات
            description =
                "📸 آموزش کامل این دستور در اینستاگرام:\n" +
                        "@DIY.BY.FARZANEH\n",
            yield = "1",
            calories = 1580,
            totalTime = "1 ساعت و نیم",
            cookTime = "1 ساعت",
            ingredients = listOf(
                Ingredient("6", "عدد", "تخم مرغ"),
                Ingredient("150", "گرم", "شکر"),
                Ingredient("0.5", "ق.چ", "وانیل"),
                Ingredient("1", "ق.چ", "بیکینگ پودر"),
                Ingredient("150", "گرم", "آرد قنادی"),
            ),
            steps = listOf(

                CookingStep("🥚 زرده و سفیدهٔ تخم‌مرغ‌ها را کاملاً از هم جدا کن."),

                CookingStep("🥄 سفیده‌ها را با همزن بزن تا کمی کف کنند. سپس شکرِ الک‌شده را به‌آرامی و به‌صورت بارانی اضافه کن و هم زدن را ادامه بده تا سفیده کاملاً حجیم، براق و فرم‌گرفته شود."),

                CookingStep("🌼 وانیل را به زرده‌ها اضافه کن."),

                CookingStep("🥚 حالا زرده‌ها را یکی‌یکی به مخلوط سفیده اضافه کن و بعد از هر زرده حدود ۳۰ ثانیه هم بزن تا کاملاً مخلوط شود. این کار کمک می‌کند بوی زهم تخم‌مرغ گرفته شود."),

                CookingStep("🌾 آرد قنادی و بیکینگ‌پودر را با هم مخلوط کن و حداقل دو بار الک کن."),

                CookingStep("🥣 مخلوط آرد را در سه مرحله به مواد اضافه کن و با لیسک به‌آرامی و به صورت دورگیری از پایین به بالا فولد کن تا پف مواد نخوابد."),

                CookingStep("🍰 یک قالب ۲۰ سانتی‌متری گالوانیزه آماده کن و مایهٔ کیک را داخل قالب بریز و چند ضربهٔ آرام به قالب بزن تا حباب‌های درشت خارج شوند."),

                CookingStep("✨از همان ابتدا روی قالب را با فویل آلومینیومی بپوشان تا کیک در پایان کاملاً لبالب قالب و یکدست پف کند."),

                CookingStep("☀️🔥 بخش سولاردام"),

                CookingStep("🔥 سولاردام را روی حالت کانوکشن (Convection) تنظیم کن و دما را روی ۱۳۵ درجهٔ سانتی‌گراد قرار بده."),

                CookingStep("⏳ اجازه بده دستگاه کاملاً پیش‌گرم شود و پس از شنیدن بوق آماده‌بودن، قالب را داخل دستگاه قرار بده."),

                CookingStep("🕐 کیک را حدود ۱ ساعت بپز."),

                CookingStep("👀 از دقیقهٔ ۵۰ به بعد کیک را بررسی کن. یک خلال دندان یا سیخ چوبی را در مرکز کیک فرو کن؛ اگر تمیز بیرون آمد، کیک آماده است."),

                CookingStep("⏱️ اگر هنوز مواد به خلال چسبید، هر ۵ دقیقه یک‌بار دوباره آن را بررسی کن تا به پخت کامل برسد."),

                CookingStep("❄️ پس از پخت، قالب را خارج کن و اجازه بده حدود ۱۰ دقیقه در دمای محیط استراحت کند."),

                CookingStep("🍰 سپس فویل را بردار، کیک را از قالب خارج کن و اجازه بده کاملاً خنک شود."),

                CookingStep("☕ نوش جان! یک کیک اسفنجی سبک، لطیف و کاملاً پف‌کرده خواهی داشت.")
            ),
            equipment = listOf(
                "قالب گالوانیزه 20 سانتی", "فویل آلومینیومی"
            )


        ),

        Recipe(
            id = "pizza",
            title = "نان پیتزا",
            image = R.drawable.pizzamain,           // ← آیکون روی سولاردام
            detailImage = R.drawable.prepizza,  // ← عکس صفحه جزئیات
            description =
                "📸 آموزش کامل این دستور در اینستاگرام:\n" +
                        "@DIY.BY.FARZANEH\n",
            yield = "1",
            totalTime = "2 ساعت",
            cookTime = "15 دقیقه",
            calories = 850,
            ingredients = listOf(
                Ingredient("200", "گرم", "آرد نول قنادی"),
                Ingredient("2", "گرم", "نمک"),
                Ingredient("2", "گرم", "خمیر مایه خشک فوری"),
                Ingredient("3", "گرم", "شگر"),
                Ingredient("2", "گرم", "بهبود دهنده"),
                Ingredient("2", "گرم", "شیر خشک"),
                Ingredient("100", "میلی لیتر", "آب"),
                Ingredient("1", "گرم", "بیکینگ پودر"),
                Ingredient("10", "گرم", "روغن"),
            ),
            equipment = listOf(
                "ورزق نسوز آلمانی", "پارو", "فویل آلومینیومی"

            ),
            steps = listOf(
                CookingStep("🥣 تمام مواد به‌جز روغن و بیکینگ‌پودر را مخلوط کن و حدود ۱۰ دقیقه ورز بده."),
                CookingStep("🧈 مخلوط روغن و بیکینگ‌پودر را آماده کن، ۵ دقیقه استراحت بده و سپس به خمیر اضافه کن."),
                CookingStep("💪 خمیر را خوب ورز بده و بعد به‌مدت ۱ ساعت در دمای محیط استراحت بده."),
                CookingStep("⏳ بعد از استراحت، خمیر را یک بار چانه کن و ۱۵ دقیقه دیگر استراحت بده."),
                CookingStep("📜 خمیر را روی ورق نسوز آلمانی پهن کن و ۵ دقیقه استراحت بده تا تغییر ابعادش کار را خراب نکند."),
                CookingStep("🍕 حالا پیتزا را به هر روشی که دوست داری روی خمیر آماده کن."),
                CookingStep("🧀 می‌توانی ابتدا سس، سپس پنیر و در نهایت مواد دلخواهت را روی خمیر قرار بده."),
                CookingStep(" ☀️ بخش سولاردام ☀️ "),
                CookingStep("🌡️ سولاردام را روی حالت کانوکشن قرار بده و با دمای ۲۲۰ درجه سانتی‌گراد پیش‌گرم کن."),
                CookingStep("⚠️ نیازی به هیچ سه‌پایه‌ای نیست؛ فقط سینی فلزی خود سولاردام کافی است."),
                CookingStep("🔔 وقتی سولاردام کاملاً داغ شد و بوق پایان پیش‌گرمایش را زد، با یک پارو زیر ورق نسوز بزن و پیتزا را آرام روی سینی فلزی سولاردام سر بده؛ درست مثل نانواها."),
                CookingStep("⏱️ دما از قبل تنظیم شده و حالا فقط باید زمان پخت را مشخص کنی."),
                CookingStep("👀 حدود ۱۵ دقیقه زمان بده، اما بعد از ۸ دقیقه حتماً به آن سر بزن. اگر قسمت مرکزی پیتزا به‌اندازه کافی طلایی شده بود، یک تکه فویل روی آن قرار بده تا نسوزد و بقیه قسمت‌ها هم کامل بپزند و طلایی شوند."),
                CookingStep("✅ اگر زودتر از ۱۵ دقیقه به نتیجه دلخواه رسیدی، پیتزا را خارج کن؛ در غیر این صورت کمی زمان پخت را افزایش بده."),
                CookingStep("🍕 در نهایت پیتزا را با پارو بیرون بیاور، روی کاغذ پیتزا قرار بده و برش بزن."),
                CookingStep("😋 نوش جان! حالا یک پیتزای فوق‌العاده با نان کریسپی و خوشمزه داری.")
            )

        )
    )
}